tests/fixtures/webhooks/billing_statement.deleted.json

{
    "id": "evt_xxxxx",
    "resource": "event",
    "type": "billing_statement.deleted",
    "data": {
        "id": "bstm_xxxxx",
        "resource": "billing_statement",
        "amount": 50000,
        "currency": "PHP",
        "customer_id": "cus_xxxxx",
        "description": "Test billing statement",
        "due_at": 0,
        "finalized_at": 0,
        "billing_statement_merchant_name": null,
        "billing_statement_number": "J2FVW1SV-0001",
        "billing_statement_url": "https://bill.payrexhq.com/b/test_bstm_xxxxx_secret_xxxxx",
        "line_items": [
            {
                "id": "bstm_li_xxxxx",
                "resource": "billing_statement_line_item",
                "description": "Line Item 1",
                "billing_statement_id": "bstm_xxxxx",
                "livemode": false,
                "quantity": 1,
                "unit_price": 50000,
                "created_at": 1773797864,
                "updated_at": 1773797864
            }
        ],
        "livemode": false,
        "merchant_id": "merc_xxxxx",
        "statement_descriptor": null,
        "status": "draft",
        "metadata": null,
        "customer": {
            "id": "cus_xxxxx",
            "name": "Test Customer",
            "email": "test@example.com"
        },
        "payment_intent": null,
        "payment_settings": {
            "payment_methods": [
                "card"
            ]
        },
        "created_at": 1773797864,
        "updated_at": 1773797945
    },
    "livemode": false,
    "pending_webhooks": 1,
    "previous_attributes": {},
    "created_at": 1773797945,
    "updated_at": 1773797945
}
